---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewElementId
source: html/e190487f-1bbb-b1fc-2cfa-aa4430332145.htm
---
# Autodesk.Revit.Creation.Application.NewElementId Method

Creates a new Autodesk::Revit::DB::ElementId^ object.

## Syntax (C#)
```csharp
public ElementId NewElementId()
```

## Returns
The new Autodesk::Revit::DB::ElementId^ object.